In [25]:
import pandas as pd
import numpy as np

In [26]:
person = {
    "first": ["Felix", "Filo","Flexx"],
    "last": ["Kimutai","Kimz","Kimz"],
    "email": ["kmtflx@gmail.com", "kimutai0003@gmail.com", "rfelix084@gmail.com"]
}

In [27]:
person

{'first': ['Felix', 'Filo', 'Flexx'],
 'last': ['Kimutai', 'Kimz', 'Kimz'],
 'email': ['kmtflx@gmail.com', 'kimutai0003@gmail.com', 'rfelix084@gmail.com']}

In [28]:
df = pd.DataFrame(person)

In [29]:
df

   first     last                  email
0  Felix  Kimutai       kmtflx@gmail.com
1   Filo     Kimz  kimutai0003@gmail.com
2  Flexx     Kimz    rfelix084@gmail.com

In [30]:
df['last']

0    Kimutai
1       Kimz
2       Kimz
Name: last, dtype: object

In [31]:
df[['first', 'last']]

   first     last
0  Felix  Kimutai
1   Filo     Kimz
2  Flexx     Kimz

In [32]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [33]:
# iloc
df.iloc[0]

first               Felix
last              Kimutai
email    kmtflx@gmail.com
Name: 0, dtype: object

In [34]:
df.iloc[2]

first                  Flexx
last                    Kimz
email    rfelix084@gmail.com
Name: 2, dtype: object

In [35]:
df.iloc[[0,2], 2]

0       kmtflx@gmail.com
2    rfelix084@gmail.com
Name: email, dtype: object

In [36]:
# loc
df

   first     last                  email
0  Felix  Kimutai       kmtflx@gmail.com
1   Filo     Kimz  kimutai0003@gmail.com
2  Flexx     Kimz    rfelix084@gmail.com

In [37]:
df.loc[[1,2], ['email', 'last']]

                   email  last
1  kimutai0003@gmail.com  Kimz
2    rfelix084@gmail.com  Kimz

In [38]:
df

   first     last                  email
0  Felix  Kimutai       kmtflx@gmail.com
1   Filo     Kimz  kimutai0003@gmail.com
2  Flexx     Kimz    rfelix084@gmail.com

In [39]:
df.set_index('email')

                       first     last
email
kmtflx@gmail.com       Felix  Kimutai
kimutai0003@gmail.com   Filo     Kimz
rfelix084@gmail.com    Flexx     Kimz

In [40]:
df

   first     last                  email
0  Felix  Kimutai       kmtflx@gmail.com
1   Filo     Kimz  kimutai0003@gmail.com
2  Flexx     Kimz    rfelix084@gmail.com

In [41]:
df.set_index('email', inplace=True)

In [42]:
df

                       first     last
email
kmtflx@gmail.com       Felix  Kimutai
kimutai0003@gmail.com   Filo     Kimz
rfelix084@gmail.com    Flexx     Kimz

In [43]:
df.index

Index(['kmtflx@gmail.com', 'kimutai0003@gmail.com', 'rfelix084@gmail.com'], dtype='object', name='email')

In [44]:
df.loc['kmtflx@gmail.com', 'last']

'Kimutai'

In [45]:
df.reset_index()

                   email  first     last
0       kmtflx@gmail.com  Felix  Kimutai
1  kimutai0003@gmail.com   Filo     Kimz
2    rfelix084@gmail.com  Flexx     Kimz

In [46]:
df

                       first     last
email
kmtflx@gmail.com       Felix  Kimutai
kimutai0003@gmail.com   Filo     Kimz
rfelix084@gmail.com    Flexx     Kimz

In [49]:
# filteration
df['last'] == 'Kimz'

email
kmtflx@gmail.com         False
kimutai0003@gmail.com     True
rfelix084@gmail.com       True
Name: last, dtype: bool

In [54]:
filt = (df['last'] == 'Kimz')

In [55]:
filt

email
kmtflx@gmail.com         False
kimutai0003@gmail.com     True
rfelix084@gmail.com       True
Name: last, dtype: bool

In [57]:
df.loc[filt]

                       first  last
email
kimutai0003@gmail.com   Filo  Kimz
rfelix084@gmail.com    Flexx  Kimz

In [60]:
df.loc[filt, 'first']

email
kimutai0003@gmail.com     Filo
rfelix084@gmail.com      Flexx
Name: first, dtype: object

In [69]:
# AND & OR |

filt = (df['last'] == 'Kimz') & (df['first'] == 'Filo')

In [70]:
df.loc[filt, 'last']

email
kimutai0003@gmail.com    Kimz
Name: last, dtype: object

In [71]:
df.loc[filt]

                      first  last
email
kimutai0003@gmail.com  Filo  Kimz

In [72]:
filt = (df['last'] == 'Kimz') | (df['first'] == 'Filo')

In [73]:
df.loc[filt, 'last']

email
kimutai0003@gmail.com    Kimz
rfelix084@gmail.com      Kimz
Name: last, dtype: object

In [74]:
df.loc[filt]

                       first  last
email
kimutai0003@gmail.com   Filo  Kimz
rfelix084@gmail.com    Flexx  Kimz

In [75]:
# Negation with tilde ~

df.loc[~filt]

                  first     last
email
kmtflx@gmail.com  Felix  Kimutai